{
  "json_data": "{\"accepted_links\":[\"Novartis enters agreement to acquire Mariana Oncology, strengthening radioligand therapy pipeline | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home News Novartis Enters Agreement To Acquire Mariana Oncology, Strengthening Radioligand Therapy Pipeline Novartis enters agreement to acquire Mariana Oncology, strengthening radioligand therapy pipeline May 02, 2024 Transaction reinforces company’s strategic focus on developing next-generation treatment options for patients living with cancer Mariana Oncology is a preclinical-stage biotechnology company focused on developing novel radioligand therapies (RLTs) to treat cancers with high unmet need Acquisition encompasses a portfolio of RLT programs across a range of solid tumor indications Basel, May 2, 2024 – Novartis today announced that it has entered into an agreement to acquire Mariana Oncology, a preclinical-stage biotechnology company based in Watertown, Massachusetts focused on developing novel radioligand therapies (RLTs) to treat cancers with high unmet patient need. The transaction bolsters the Novartis RLT pipeline and expands the company’s research infrastructure and clinical supply capabilities, supporting Novartis strategic priorities in oncology and RLT platform innovation. The acquisition encompasses a robust portfolio of RLT programs spanning lead optimization to early development across a range of solid tumor indications such as breast, prostate and lung cancer – including development candidate MC-339, an actinium-based RLT being investigated in small cell lung cancer. “The acquisition of Mariana Oncology reflects our commitment to radioligand therapy as one of our company’s key technology platforms and strengthens our leadership in this field,” said Fiona Marshall, President of Biomedical Research at Novartis. “We are excited to work with the Mariana team to bring forward next-generation RLTs for patients living with cancer and together shape the future of RLT as a pillar for oncology treatment.” RLTs, or radiopharmaceuticals, are a form of precision medicine that combines a tumor-targeting molecule (ligand) with a therapeutic radioisotope (a radioactive particle). RLTs bind to specific receptors expressed on the surface of certain types of tumors. Once bound to a target cell, emissions from the therapeutic radioisotope cause DNA damage that can inhibit cell growth and replication and potentially trigger cell death. This targeted approach enables the delivery of radiation to the tumor, while limiting damage to the surrounding cells. “As pioneers in radioligand therapies, we are dedicated to building on our scientific leadership and expanding the breadth of these potentially transformative treatments to a broader range of cancer types,” said Shiva Malek, Global Head of Oncology for Biomedical Research at Novartis. “This acquisition brings to Novartis phenomenal talent and new capabilities in RLT research that complement our wide-ranging internal efforts to explore novel isotopes, combinations, disease areas, and more.” As of today, Novartis has two approved RLTs for certain patients with metastatic castration-resistant prostate cancer and for certain types of gastroenteropancreatic neuroendocrine tumors. The company’s early and late pipeline has several programs in or entering the clinic, including a spectrum of studies and assets for prostate cancer, as well as other preclinical and discovery programs to identify the next wave of novel RLTs. Novartis is actively exploring new isotopes and new combinations with complementary mechanisms of action, as well as looking at new disease areas for RLT. Under the terms of the agreement, Novartis will make an upfront payment of USD 1 billion and additional USD 750 million in payments upon completion of pre-specified milestones. The transaction is subject to customary closing conditions. Disclaimer This media update contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements can generally be identified by words such as “potential,” “can,” “will,” “plan,” “may,” “could,” “would,” “expect,” “anticipate,” “look forward,” “believe,” “committed,” “investigational,” “pipeline,” “launch,” or similar terms, or by express or implied discussions regarding potential marketing approvals, new indications or labeling for any investigational or approved products resulting from the MC-339 program, the acquisition of Mariana Oncology, or regarding potential future revenues from MC-339. You should not place undue reliance on these statements. Such forward-looking statements are based on our current beliefs and expectations regarding future events, and are subject to significant known and unknown risks and uncertainties. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those set forth in the forward-looking statements. There can be no guarantee that any investigational or approved products resulting from the MC-339 program will be submitted or approved for sale or for any additional indications or labeling in any market, or at any particular time. Neither can there be any guarantee expected benefits or synergies from this transaction will be achieved in the expected timeframe, or at all, nor can there be any guarantee that the MC-339 program will be commercially successful in the future. In particular, our expectations regarding MC-339 or the transaction described in this media update could be affected by, among other things, the uncertainties inherent in research and development, including clinical trial results and additional analysis of existing clinical data; regulatory actions or delays or government regulation generally; global trends toward health care cost containment, including government, payor and general public pricing and reimbursement pressures and requirements for increased pricing transparency; our ability to obtain or maintain proprietary intellectual property protection; the particular prescribing preferences of physicians and patients; general political, economic and business conditions, including the effects of and efforts to mitigate pandemic diseases such as COVID-19; safety, quality, data integrity or manufacturing issues; potential or actual data security and data privacy breaches, or disruptions of our information technology systems, and other risks and factors referred to in Novartis AG’s current Form 20-F on file with the US Securities and Exchange Commission. Novartis is providing the information in this media update as of this date and does not undertake any obligation to update any forward-looking statements contained in this media update as a result of new information, future events or otherwise. About Novartis Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Reimagine medicine with us: Visit us at https://www.novartis.com and connect with us on LinkedIn , Facebook , X/Twitter and Instagram . # # # Novartis Media Relations E-mail: [email protected] Central North America Richard Jarvis +41 79 584 2326 Michael Meo +1 862 274 5414 Anja von Treskow +41 79 392 9697 Marlena Abdinoor +1 617 335 9525 Anna Schäfers +41 79 801 7267 Kevin Jiang +1 617 334 5914 Switzerland +41 79 619 2035 Satoshi Sugimoto +41 79 619 2035 Novartis Investor Relations Central investor relations line: +41 61 324 7944 E-mail: [email protected] Central North America Isabella Zinck +41 61 324 7188 Sloan Simpson +1 862 345 4440 Nicole Zinsli-Somm +41 61 324 3809 Jonathan Graham +1 201 602 9921 Imke Kappes +41 61 324 8269 Parag Mahanti +1 973 876 4912 AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print pdf Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"Facing the fear of breast cancer recurrence | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Header Home Stories Facing The Fear Of Breast Cancer Recurrence Patient Perspectives Facing the fear of breast cancer recurrence When Laurie Brunner found a lump in her breast just before Thanksgiving in 2018, it was the beginning of one of the most difficult periods of her life. Although treatment put her cancer into remission, she found herself dealing with an emotional toll that affects many survivors of early-stage breast cancer: the fear of it coming back. Photos: Brent Stirton, Getty Images for Novartis Jan 31, 2024 Laurie carves Halloween pumpkins with her family. Laurie was diagnosed with stage II breast cancer in December 2018. Only a few weeks later, she underwent surgery followed by eight rounds of chemotherapy. One of my first concerns was how to tell my son who was only 7 at the time,” Laurie says. “I ended up saying they found some bad cells in my body that needed to come out, and that the medicine would make me tired and make my hair fall out. He also helped to shave my head — we gave him the clippers and he did a good chunk of that. Laurie at home on her porch. In 2019, Laurie was told by her oncologist that her cancer was in remission but that there was a 20% risk of it coming back. Approximately one-third of those diagnosed with stage II and more than half of those diagnosed with stage III HR+/HER2- early breast cancer experience cancer recurrence. I felt that anxiety every day. I became attuned to every sensation in my body. It was the first thing that came to mind if I felt some random pain. I’ve stopped thinking about it every day, but it’s still easy for something to throw me right back. Laurie (center) with friends who supported her through cancer treatment, including shaving their heads in solidarity. During this time, a friend told her about a clinical trial of a Novartis treatment for patients with early breast cancer. After going through screening, she entered the trial in October 2019 at Mass General Cancer Center in Boston. I did it for me,” she says. “I was only 48. I had a small child. And I was determined to live. But I also did it to advance the science and help others: so many people supported me, and I felt a responsibility to help lead the way for those who come after me. I’m really proud of that. Laurie stands next to the Charles River in Boston. I'm not the same person that I was. Not mentally, not emotionally, not physically. Until earlier this year, when I took a leave of absence from work, I never had time to just heal and process what had happened to me. But I feel hopeful. I have many more years of life left. I can't know if or when there will be recurrence, but I know I survived breast cancer once and could do it again. I know I'm capable of getting through that. Tanya Taran, global program head for breast cancer at Novartis. In 2023, we reported the results of the clinical trial in which Laurie participated. They showed that a Novartis medicine significantly reduced risk of recurrence by 25% across a broad population of patients with early breast cancer. ( Photo: Bjoern Myhre, Novartis) We have this great responsibility to design studies that improve patients' chance to avoid the recurrence of their cancer but also balance it with their quality of life. Oncology Combining the power of science and empathy to unravel the inner workings of cancer and develop innovative therapies that restore hope to those with cancer and their loved ones. Learn more Stories AddToAny buttons Share Post Share Whatsapp Linkedin Email Cancer Oncology Disease Awareness Living With Disease Patient Voices Printable Links Block (Content) Print PDF Novartis Stories Patient Perspectives Listening to the CML patient community Patient Perspectives Giving voice to people with a misunderstood disease Patient Perspectives Shoulder to shoulder Pagination Page 1 Next page ›› View all Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"Novartis radioligand therapy Lutathera® FDA approved as first medicine specifically for pediatric patients with gastroenteropancreatic neuroendocrine tumors | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home News Novartis Radioligand Therapy Lutathera® FDA Approved As First Medicine Specifically For Pediatric Patients With Gastroenteropancreatic Neuroendocrine Tumors Novartis radioligand therapy Lutathera® FDA approved as first medicine specifically for pediatric patients with gastroenteropancreatic neuroendocrine tumors Apr 23, 2024 Approval based on NETTER-P trial in which Lutathera demonstrated a consistent safety profile and comparable drug exposure between pediatric (ages 12-17) and adult patients Gastroenteropancreatic neuroendocrine tumors (GEP-NETs) are a rare cancer that is often unresectable and commonly diagnosed in the late stages of disease Novartis, a leader in radioligand therapy (RLT), is investigating a portfolio of RLTs to treat a broad range of cancers, including GEP-NETs, lung, prostate, breast, colon, brain and pancreatic cancers Basel, April 23, 2024 – Novartis today announced that the U.S. Food and Drug Administration (FDA) approved Lutathera ® (USAN: lutetium Lu 177 dotatate / INN: lutetium (177Lu) oxodotreotide) for the treatment of pediatric patients 12 years and older with somatostatin receptor-positive (SSTR+) gastroenteropancreatic neuroendocrine tumors (GEP-NETs), including foregut, midgut, and hindgut NETs. This approval makes Lutathera the first therapy specifically reviewed and approved for use in pediatric patients with GEP-NETs. “Lutathera is now the very first therapy approved specifically for children with GEP-NETs, offering new hope to young patients living with this rare cancer,” said Tina Deignan, Therapeutic Area Head, Oncology US. “Radioligand therapies have extraordinary potential to shape the future of cancer care. With this approval, we have taken another vital step toward fulfilling that vision, strengthening our commitment to researching and developing the RLT platform across multiple cancer types and treatment settings.” NETs are a type of cancer that originates in neuroendocrine cells throughout the body and are commonly considered slow-growing malignancies 1 . The diagnosis of NETs is often delayed due to the inactive nature of the disease, and approximately 10% to 20% of pediatric patients are diagnosed with metastatic disease 2,3 . Even though NETs are an orphan disease, their incidence has increased over the past several decades 1,4-6 . “While GEP-NETs in children and adolescents are rare, the impact can be devastating. Today’s approval addresses a critical need for new treatment options for these vulnerable patients,” said Dr. Theodore Laetsch, trial investigator and Director, Developmental Therapeutics Program, Children’s Hospital of Philadelphia (CHOP), a NETTER-P clinical trial site. “The introduction of radioligand therapy significantly advanced how we treat GEP-NETs, and I’m encouraged that younger patients now have the potential to benefit from this innovation.” The approval was based on the NETTER-P trial, which evaluated Lutathera in patients aged 12 to \\u003c18 years old with SSTR+ GEP-NETs 7 . The study reported a safety profile consistent with the adult population studied in NETTER-1, the pivotal trial for approval of Lutathera in adults. In addition, the estimated radiation absorbed dose in pediatric patients was within established organ thresholds for external beam radiation and comparable to that in adults for the approved dose. About Lutathera ® Lutathera ® (lutetium Lu 177 dotatate) is approved in the US for the treatment of adults and children 12 years and older with SSTR-positive GEP-NETs, including those in the foregut, midgut and hindgut, an indication which includes the populations studied in the randomized, controlled Phase III trials NETTER-1 and NETTER-2. Lutathera is also approved in Europe for unresectable or metastatic, progressive, well-differentiated (G1 and G2), SSTR-positive GEP-NETs in adults, and in Japan for SSTR-positive NETs 8,9 . Novartis and Radioligand Therapy (RLT) Novartis is reimagining cancer care with RLT for patients with advanced cancers. By harnessing the power of radioactive atoms and applying it to advanced cancers, RLT is theoretically able to deliver radiation to target cells anywhere in the body 10,11 . Novartis is investigating a broad portfolio of RLTs, exploring new isotopes, ligands and combination therapies to look beyond gastroenteropancreatic neuroendocrine tumors (GEP-NETs) and prostate cancer and into breast, colon, lung and pancreatic cancer. With established global expertise, and specialized supply chain and manufacturing capabilities across the Novartis network, we are supporting growing demand for our RLT medicines. Our production capabilities continue to expand and now include sites in Millburn, US, Zaragoza, Spain, Ivrea, Italy and our new state-of-the-art facility in Indianapolis, US. We recently announced plans to expand our manufacturing capabilities and build additional points of supply in Sasayama, Japan, and Haiyan, Zhejiang, China, to produce RLTs for patients in Japan and China. We are continually evaluating additional opportunities to increase capacity around the world. Disclaimer This press release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements can generally be identified by words such as “potential,” “can,” “will,” “plan,” “may,” “could,” “would,” “expect,” “anticipate,” “look forward,” “believe,” “committed,” “investigational,” “pipeline,” “launch,” or similar terms, or by express or implied discussions regarding potential marketing approvals, new indications or labeling for the investigational or approved products described in this press release, or regarding potential future revenues from such products. You should not place undue reliance on these statements. Such forward-looking statements are based on our current beliefs and expectations regarding future events, and are subject to significant known and unknown risks and uncertainties. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those set forth in the forward-looking statements. There can be no guarantee that the investigational or approved products described in this press release will be submitted or approved for sale or for any additional indications or labeling in any market, or at any particular time. Nor can there be any guarantee that such products will be commercially successful in the future. In particular, our expectations regarding such products could be affected by, among other things, the uncertainties inherent in research and development, including clinical trial results and additional analysis of existing clinical data; regulatory actions or delays or government regulation generally; global trends toward health care cost containment, including government, payor and general public pricing and reimbursement pressures and requirements for increased pricing transparency; our ability to obtain or maintain proprietary intellectual property protection; the particular prescribing preferences of physicians and patients; general political, economic and business conditions, including the effects of and efforts to mitigate pandemic diseases; safety, quality, data integrity or manufacturing issues; potential or actual data security and data privacy breaches, or disruptions of our information technology systems, and other risks and factors referred to in Novartis AG’s current Form 20-F on file with the US Securities and Exchange Commission. Novartis is providing the information in this press release as of this date and does not undertake any obligation to update any forward-looking statements contained in this press release as a result of new information, future events or otherwise. About Novartis Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Reimagine medicine with us: Visit us at https://www.novartis.com and connect with us on LinkedIn , Facebook , X/Twitter and Instagram . References Man D, Wu J, Shen Z, Zhu X. Prognosis of patients with neuroendocrine tumor: a SEER database analysis. Cancer Manag Res. 2018;10:5629-5638. Published 2018 Nov 13. doi:10.2147/CMAR.S174907Dasari. Parham DM. Neuroectodermal and neuroendocrine tumors principally seen in children. Am J Clin Pathol. 2001;115(suppl):S113-S128. Sarvida ME, O’Dorisio MS. Neuroendocrine tumors in children and young adults: rare or not so rare. Endocrinol Metab Clin North Am. 2011;40:65-80. A, Shen C, Halperin D, Zhao B, Zhou S, Xu Y, Shih T, Yao JC. Trends in the Incidence, Prevalence, and Survival Outcomes in Patients With Neuroendocrine Tumors in the United States. JAMA Oncol. 2017; doi:10.1001/jamaoncol.2017.0589 Frilling A, Åkerström G, Falconi, M, et al. Neuroendocrine tumor disease: an evolving landscape. Endoc Related Cancer 2012; 19: R163-815. Lawrence B, Gustafsson BI, et al. The Epidemiology of Gastroenteropancreatic Neuroendocrine Tumors. Endocrinol Metab Clin N Am. 2011; 40:1–18 ClinicalTrials.gov. NETTER-P (NCT04711135). Study to Evaluate Safety and Dosimetry of Lutathera in Adolescent Patients With GEP-NETs and PPGLs. Accessed March 2024. Lutathera. Full Prescribing Information. 2018. Revised March 2023. https://www.novartis.com/us-en/sites/novartis_us/files/lutathera.pdf . Lutathera. Summary of Product Characteristics (SmPC). 2018. Revised February 2023. https://www.ema.europa.eu/en/documents/product-information/lutathera-epar-product-information_en.pdf . Jadvar H. Targeted radionuclide therapy: an evolution toward precision cancer treatment. AJR Am J Roentagenol. 2017;209(2);277-288. Jurcic JG, Wong JYC, Knoc SJ, et al. Targeted radionuclide therapy. In: Tepper JE, Foote RE, Michalski JM, eds. Gunderson \\u0026 Tepper’s Clinical Radiation Oncology. 5th ed. Elsevier, Inc. 2021;71(3):209-249 # # # Novartis Media Relations E-mail: [email protected] Central North America Richard Jarvis +41 79 584 2326 Michael Meo +1 862 274 5414 Anja von Treskow +41 79 392 9697 Marlena Abdinoor +1 617 335 9525 Anna Schäfers +41 79 801 7267 Switzerland Satoshi Sugimoto +41 79 619 2035 Novartis Investor Relations Central investor relations line: +41 61 324 7944 E-mail: [email protected] Central North America Isabella Zinck +41 61 324 7188 Sloan Simpson +1 862 345 4440 Nicole Zinsli-Somm +41 61 324 3809 Jonathan Graham +1 201 602 9921 Imke Kappes +41 61 324 8269 Parag Mahanti +1 973 876 4912 Oncology Clinical Trials Cancer AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print pdf Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"Latest Novartis Kisqali® NATALEE analysis reinforces 25% reduction in risk of recurrence across broad population of patients with early breast cancer; supports regulatory submissions | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home News Latest Novartis Kisqali® NATALEE Analysis Reinforces 25% Reduction In Risk Of Recurrence Across Broad Population Of Patients With Early Breast Cancer; Supports Regulatory Submissions Latest Novartis Kisqali® NATALEE analysis reinforces 25% reduction in risk of recurrence across broad population of patients with early breast cancer; supports regulatory submissions Dec 08, 2023 With 5.6 months of additional follow-up and 78.3% of patients having completed Kisqali ® (ribociclib) investigational treatment, the updated analysis shows sustained iDFS benefit and stability in secondary endpoints including overall survival (OS) 1,2 iDFS benefit remains consistent across key patient subgroups; among patients with stage II and stage III tumors, Kisqali lowered risk by 30% and 24.5%, respectively 1, 2 Latest analysis continues to show a well-tolerated safety profile in line with previously reported results, and quality of life for Kisqali patients preserved vs. endocrine therapy (ET) alone 1,2, 3 Risk of recurrence remains a short and long term concern; one in eight women treated with ET alone in NATALEE likely to experience invasive disease at 3 years 1,2 Kisqali is currently approved in the metastatic setting, where it has consistently demonstrated statistically significant OS benefit across three Phase III trials 4-15 ; Novartis has filed NATALEE results with EMA and will submit these latest EBC data to the FDA by end of year Basel, December 8, 2023 – Novartis today announced results from an updated invasive disease-free survival (iDFS) analysis of the pivotal Phase III NATALEE trial, with a median follow-up of 33.3 months and following Kisqali ® (ribociclib) treatment completion by 78.3% of patients. Results reinforce the benefit seen at the earlier interim analysis, with a 25.1% (HR=0.749; 95% CI: 0.628, 0.892; p=0.0006) reduction in risk of disease recurrence in patients with stage II and III hormone receptor-positive/human epidermal growth factor receptor 2-negative (HR+/HER2-) early breast cancer (EBC) treated with adjuvant Kisqali plus a non-steroidal aromatase inhibitor as standard endocrine therapy (ET) compared to ET alone 1,2 . Late-breaking data from this analysis will be presented today at the 2023 San Antonio Breast Cancer Symposium (SABCS) Annual Meeting. Kisqali iDFS benefit across pre-specified subgroups 1 : Subgroup 3-year iDFS rate, % HR (95% Cl) ITT population Kisqali + ET: 90.7 0.749 ET alone: 87.6 (0.628, 0.892) AJCC Stage II Kisqali + ET: 94.2 0.700 ET alone: 92.6 (0.496, 0.986) AJCC Stage III Kisqali + ET: 88.1 0.755 ET alone: 83.8 (0.616, 0.926) Node-negative (N0) Kisqali + AI: 93.2 0.723 ET alone: 90.6 (0.412, 1.268) “As clinicians, we know that patients diagnosed with HR+/HER2- early breast cancer remain at risk of recurrence for decades, despite adjuvant endocrine therapy. Moreover, the real risk observed in this analysis in patients treated with endocrine therapy alone, including those with node-negative disease, highlights the need for effective and tolerable treatment options that can help keep patients cancer-free in the short and long term,” said Gabriel N. Hortobagyi, MD, FACP, Professor of Breast Medical Oncology, The University of Texas MD Anderson Cancer Center. “The updated NATALEE results reinforce the potential of ribociclib to help address these needs for the broader at-risk population with no added disruptions to patients’ quality of life compared to endocrine therapy alone.” Kisqali data across all secondary efficacy endpoints was also consistent, including distant disease-free survival (DDFS) (25.1% risk reduction) and recurrence-free survival (RFS) (27.3% risk reduction). With fewer than 4% of events in both treatment arms (3.3% in the Kisqali-ET arm and 3.4% in the ET only arm), overall survival (OS) results will continue to evolve in the longer term 1,2 . The safety profile of Kisqali at the 400 mg dose remained consistent with previously reported results, with generally low-grade adverse events (AEs), other than laboratory abnormalities. AEs of special interest (grade 3 or higher) were neutropenia (44.3%), liver-related AEs (e.g., elevated transaminases) (8.6%), and QT interval prolongation (1.0%) 1,2 . No new safety signals were identified 1,2 . “The final iDFS analysis of NATALEE represents a significant milestone, building upon the robust evidence supporting Kisqali as a potential new adjuvant treatment for a broad, clinically common and identifiable population of patients with stage II and III HR+/HER2- early breast cancer,” said Jeff Legos, Executive Vice President, Global Head of Oncology Development at Novartis. “We are seeking approval for Kisqali in early breast cancer from health authorities worldwide, aspiring to more than double the number of at-risk patients who could potentially benefit from CDK4/6 inhibitor treatment in this setting.” Novartis submitted NATALEE data to the European Medicines Agency and plans to finalize submission to the U.S. Food and Drug Administration by end of year. About NATALEE NATALEE is a global Phase III multi-center, randomized, open-label trial to evaluate the efficacy and safety of Kisqali ® (ribociclib) with ET as an investigational adjuvant treatment versus ET alone in patients with stage II and III HR+/HER2- EBC, being conducted in collaboration with TRIO 2 . The adjuvant ET in both treatment arms was a non-steroidal aromatase inhibitor (NSAI; anastrozole or letrozole) and goserelin if applicable 2 . The primary endpoint of NATALEE is iDFS as defined by the Standardized Definitions for Efficacy End Points (STEEP) criteria 2 . A total of 5,101 adult patients with HR+/HER2- EBC across 20 countries were randomized in the trial 2 . Results previously announced at the American Society of Clinical Oncology (ASCO) Annual Meeting 2023 showed Kisqali plus ET, compared to ET alone, lowered the risk of cancer recurrence by 25.2% (HR=0.748; 95% CI: 0.618, 0.906; p=0.0014), along with consistent clinically meaningful iDFS benefit across key pre-specified subgroups 2 . NATALEE explored a lower starting dose (400 mg) of Kisqali than the dose approved for treatment in metastatic breast cancer (MBC) (600 mg) with the goal to minimize disruptions to patient quality of life without compromising efficacy. Compared to the 600 mg dose, the safety profile of Kisqali at 400 mg was observed to have lower rates of symptomatic AEs and less need for dose modifications when administered up to three years 2 . AEs of special interest (grade 3 or higher) are neutropenia (44.3%), liver-related AEs (e.g., elevated transaminases) (8.6%), and QT interval prolongation (1.0%) 1,2 . About Early Breast Cancer More than 90% of patients diagnosed with breast cancer have EBC 16 . Despite adjuvant ET, approximately one-third of those diagnosed with stage II and more than half of those diagnosed with stage III HR+/HER2- EBC experience cancer recurrence 17 , 18 . The risk of recurrence continues over decades with more than half of breast cancer recurrences occurring five or more years after diagnosis 17 , 19 . For many of these patients, there are currently no targeted therapeutic options outside of the standard chemotherapy and ET 20 . About Kisqali ® (ribociclib) Kisqali has consistently demonstrated OS benefit while preserving or improving quality of life across three Phase III trials in MBC 4-15 . Updates to the NCCN Guidelines ® for breast cancer, released in January 2023, recommend ribociclib (Kisqali) as the only Category 1 preferred CDK4/6 inhibitor for first-line treatment of patients with HR+/HER2- MBC when combined with an aromatase inhibitor (AI) 21 . Additionally, Kisqali has the highest rating of any CDK4/6 inhibitor on the ESMO Magnitude of Clinical Benefit Scale, achieving a score of five out of five for first-line pre-menopausal patients with HR+/HER2- advanced breast cancer 22 . Further, Kisqali in combination with either letrozole or fulvestrant has uniquely, among other CDK4/6 inhibitors, received a score of four out of five for post-menopausal patients with HR+/HER2- advanced breast cancer treated in the first line 23 . Kisqali has been approved in 99 countries worldwide, including by the United States Food and Drug Administration (FDA) and the European Commission. In the U.S., Kisqali is approved for the treatment of adult patients with HR+/HER2- advanced or MBC in combination with an AI as initial ET or fulvestrant as initial ET or following disease progression on ET in post-menopausal women or in men. In the EU, Kisqali is approved for the treatment of women with HR+/HER2- advanced or MBC in combination with either an AI or fulvestrant as initial ET or following disease progression. In pre- or peri-menopausal women, the ET should be combined with a luteinizing hormone-releasing hormone agonist 20 . Novartis is committed to continuing to study Kisqali in breast cancer. Novartis is collaborating with SOLTI, which is leading the HARMONIA study to test whether Kisqali changes tumor biology to enable a better response to ET compared to Ibrance ® * (palbociclib) for patients with HR+/HER2-, HER2-enriched subtype 24 MBC, and with the Akershus University Hospital in Norway on the NEOLETRIB trial, a neoadjuvant Phase II trial studying the effects of Kisqali in HR+/HER2- EBC to discover the potentially unique underlying mechanism of action 25 . Kisqali was developed by the Novartis Institutes for BioMedical Research (NIBR) under a research collaboration with Astex Pharmaceuticals. Please see full Prescribing Information for Kisqali, available at www.Kisqali.com Disclaimer This press release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements can generally be identified by words such as “potential,” “can,” “will,” “plan,” “may,” “could,” “would,” “expect,” “anticipate,” “look forward,” “believe,” “committed,” “investigational,” “pipeline,” “launch,” or similar terms, or by express or implied discussions regarding potential marketing approvals, new indications or labeling for the investigational or approved products described in this press release, or regarding potential future revenues from such products. You should not place undue reliance on these statements. Such forward-looking statements are based on our current beliefs and expectations regarding future events, and are subject to significant known and unknown risks and uncertainties. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those set forth in the forward-looking statements. There can be no guarantee that the investigational or approved products described in this press release will be submitted or approved for sale or for any additional indications or labeling in any market, or at any particular time. Nor can there be any guarantee that such products will be commercially successful in the future. In particular, our expectations regarding such products could be affected by, among other things, the uncertainties inherent in research and development, including clinical trial results and additional analysis of existing clinical data; regulatory actions or delays or government regulation generally; global trends toward health care cost containment, including government, payor and general public pricing and reimbursement pressures and requirements for increased pricing transparency; our ability to obtain or maintain proprietary intellectual property protection; the particular prescribing preferences of physicians and patients; general political, economic and business conditions, including the effects of and efforts to mitigate pandemic diseases; safety, quality, data integrity or manufacturing issues; potential or actual data security and data privacy breaches, or disruptions of our information technology systems, and other risks and factors referred to in Novartis AG’s current Form 20-F on file with the US Securities and Exchange Commission. Novartis is providing the information in this press release as of this date and does not undertake any obligation to update any forward-looking statements contained in this press release as a result of new information, future events or otherwise. About Novartis Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Reimagine medicine with us: Visit us at https://www.novartis.com and connect with us on LinkedIn , Facebook , X/Twitter and Instagram . References Novartis Data on File. Slamon D, Stroyakovskiy D, Yardley D, et al. Ribociclib and endocrine therapy as adjuvant treatment in patients with HR+/HER2− early breast cancer: primary results from the Phase III NATALEE trial. Presented at the American Society of Clinical Oncology Annual Meeting, June 2, 2023. Chicago, USA. Fasching P, Slamon D et al. Health-related quality of life in the phase 3 NATALEE study of adjuvant ribociclib plus a NSAI vs NSAI alone in patients with HR+/HER2− early breast cancer). Presentation at European Society for Medical Oncology (ESMO) Virtual Plenary on 14 September 2023. Yardley DA, Yap YS, et al. Pooled exploratory analysis of survival in patients (pts) with HR+/HER2- advanced breast cancer (ABC) and visceral metastases (mets) treated with ribociclib (RIB) + endocrine therapy (ET) in the MONALEESA (ML) trials. Poster presented at the European Society of Medical Oncology Congress. September 9-13, 2022. Paris, France. Neven P, Fasching PA, et al. Updated overall survival (OS) results from the first-line (1L) population in the Phase III MONALEESA-3 trial of postmenopausal patients with HR+/HER2- advanced breast cancer (ABC) treated with ribociclib (RIB) + fulvestrant (FUL). Mini oral presented at the European Society for Medical Oncology Breast Cancer Congress. May 4, 2022. Paris, France. Hortobagyi GN, Stemmer SM, Burris HA, et al. Overall Survival with Ribociclib plus Letrozole in Advanced Breast Cancer. New England Journal of Medicine . 2022;386(10):942-950. doi:10.1056/NEJMoa2114663 Hortobagyi GN, et al. Overall survival (OS) results from the phase III MONALEESA (ML)-2 trial of postmenopausal patients with hormone receptor positive/human epidermal growth factor receptor 2 negative (HR+/HER2−) advanced breast cancer (ABC) treated with endocrine therapy (ET) ± ribociclib. Proffered paper presented at the European Society of Medical Oncology Congress, September 16-21, 2021. Lugano, Switzerland. Im S-A, Lu Y-S, Bardia A, et al. Overall survival with ribociclib plus endocrine therapy in breast cancer. New England Journal of Medicine . 2019;381(4):307-316. doi:10.1056/nejmoa1903765 Slamon DJ, Neven P, Chia S, et al. Overall Survival with Ribociclib plus Fulvestrant in Advanced Breast Cancer. New England Journal of Medicine . 2020;382(6):514-524. doi:10.1056/NEJMoa1911149 Slamon DJ, Neven P, Chia S, et al. Overall survival (OS) results of the Phase III MONALEESA-3 trial of postmenopausal patients (pts) with hormone receptor–positive (HR+), human epidermal growth factor 2–negative (HER2−) advanced breast cancer (ABC) treated with fulvestrant (FUL) ± ribociclib (RIB). Presented at the European Society of Medical Oncology Congress, September 29, 2019, Barcelona, Spain. Slamon DJ, Neven P, Chia S, et al. Updated overall survival (OS) results from the Phase III MONALEESA-3 trial of postmenopausal patients (pts) with HR+/HER2− advanced breast cancer (ABC) treated with fulvestrant (FUL) ± ribociclib (RIB. Presented at the American Society of Clinical Oncology Annual Meeting, June 5, 2021. Chicago, USA. Tripathy D, Im S-A, Colleoni M, et al. Updated overall survival (OS) results from the phase III MONALEESA-7 trial of pre- or perimenopausal patients with HR+/HER2− advanced breast cancer (ABC) treated with endocrine therapy (ET) ± ribociclib. Presented at the San Antonio Breast Cancer Symposium, December 9, 2020. Texas, USA. Yardley D, Nusch A, Yap YS, et al. Overall survival (OS) in patients (pts) with advanced breast cancer (ABC) with visceral metastases (mets), including those with liver mets, treated with ribociclib (RIB) plus endocrine therapy (ET) in the MONALEESA (ML) -3 and -7 trials. Presented at the American Society of Clinical Oncology (ASCO) Annual Meeting. June 2020. Chicago, USA. O’Shaughnessy J, Stemmer SM, Burris HA, et al. Overall survival subgroup analysis by metastatic site from the Phase III MONALEESA-2 study of first-line ribociclib + letrozole in postmenopausal patients with HR+/HER2− advanced breast cancer. Presented at the San Antonio Breast Cancer Symposium, December 7-10, 2021. Texas, USA. Kisqali (ribociclib) Prescribing Information. Iqbal J, Ginsburg O, Rochon PA, Sun P, Narod SA. Differences in breast cancer stage at diagnosis and cancer-specific survival by race and ethnicity in the United States [published correction appears in JAMA . 2015 Jun 9;313(22):2287]. JAMA . 2015;313(2):165-173. doi:10.1001/jama.2014.17322 Pan H, Gray R, Braybrooke J, et al; EBCTCG. 20-year risks of breast-cancer recurrence after stopping endocrine therapy at 5 years. N Engl J Med . 2017;377(19):1836-1846. doi:10.1056/NEJMoa1701830 Pan H, Gray R, Braybrooke J, et al; EBCTCG. 20-year risks of breast-cancer recurrence after stopping endocrine therapy at 5 years. N Engl J Med . 2017;377(19):1836-1846;(suppl). doi:10.1056/NEJMoa1701830 Gomis R, Gawrzak S. Tumor cell dormancy. Mol Oncol. 2017;11(1):62-78. American Cancer Society. Treatment of breast cancer stages I-III. Revised April 12, 2022. Available at: https://www.cancer.org/cancer/breast-cancer/treatment/treatment-of-breast-cancer-by-stage/treatment-of-breast-cancer-stages-i-iii.html/ Accessed August 2023. NCCN Clinical Practice Guidelines in Oncology (NCCN Guidelines ® ) - Breast Cancer. NCCN Guidelines. Published March 2023. Available at: https://www.nccn.org/professionals/physician_gls/pdf/breast.pdf / Accessed August 2023. European Society for Medical Oncology – Magnitude of Clinical Benefit Scale Scorecard. Published April 20, 2020. Updated August 21, 2020. Available at: https://www.esmo.org/guidelines/esmo-mcbs/esmo-mcbs-scorecards/scorecard-158-1/ Accessed August 2023. European Society for Medical Oncology – Magnitude of Clinical Benefit Scale Scorecard. Published March 29, 2022. Available at: https://www.esmo.org/guidelines/esmo-mcbs/esmo-mcbs-scorecards/scorecard-9-1/ Accessed August 2023. Ribociclib vs. palbociclib in patients with advanced breast cancer within the HER2-enriched intrinsic subtype (HARMONIA). Identifier NCT05207709. Revised April 4, 2022. Available at: https://clinicaltrials.gov/ct2/show/NCT05207709/ Accessed August 2023. Novartis and Vestre Viken Hospital Trust (2022, April 1 – 2024, December 1). Neoadjuvant Treatment of Locally-advanced Breast Cancer Patients With Ribociclib and Letrozole (NEOLETRIB). Identifier NCT05163106. Available at: https://clinicaltrials.gov/ct2/show/NCT05163106/ Accessed August 2023. *Ibrance ® is a registered trademark of Pfizer, Inc. # # # Novartis Media Relations E-mail: [email protected] Central North America Richard Jarvis +41 79 584 2326 Julie Masow +1 862 579 8456 Anja von Treskow +41 79 392 9697 Michael Meo +1 862 274 5414 Anna Schäfers +41 79 801 7267 Marlena Abdinoor +1 617 335 9525 Switzerland Satoshi Sugimoto +41 79 619 2035 Novartis Investor Relations Central investor relations line: +41 61 324 7944 E-mail: [email protected] Central North America Samir Shah +41 61 324 7944 Sloan Simpson +1 862 345 4440 Isabella Zinck +41 61 324 7188 Jonathan Graham +1 201 602 9921 Nicole Zinsli-Somm +41 61 324 3809 Parag Mahanti +1 973 876 4912 Imke Kappes +41 61 324 8269 Zain Iqbal +41 61 324 0390 Oncology Innovation Diseases AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print pdf Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"Novartis Lutathera® significantly reduced risk of disease progression or death by 72% as first-line treatment for patients with advanced gastroenteropancreatic neuroendocrine tumors | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home News Novartis Lutathera® Significantly Reduced Risk Of Disease Progression Or Death By 72% As First-line Treatment For Patients With Advanced Gastroenteropancreatic Neuroendocrine Tumors Novartis Lutathera® significantly reduced risk of disease progression or death by 72% as first-line treatment for patients with advanced gastroenteropancreatic neuroendocrine tumors Jan 19, 2024 In the Phase III NETTER-2 trial, Lutathera plus octreotide LAR significantly extended median PFS to 22.8 months vs. 8.5 months with high-dose octreotide LAR in patients with newly diagnosed grade 2 and 3 advanced gastroenteropancreatic neuroendocrine tumors (GEP-NETs) 1 NETTER-2 is the first and only positive Phase III trial for a radioligand therapy (RLT) in the first-line setting, demonstrating the potential of RLTs in earlier lines Novartis, a leader in radioligand therapy, is investigating a broad portfolio of RLTs in advanced cancers, in addition to GEP-NETs, including lung, prostate, breast, colon, glioblastoma and pancreatic cancers to continue reimagining medicine for patients Basel, January 19, 2024 – Novartis today presented data from the Phase III NETTER-2 trial showing that Lutathera ® (INN: lutetium (177Lu) oxodotreotide / USAN: lutetium Lu 177 dotatate) plus long-acting release (LAR) octreotide reduced the risk of disease progression or death by 72% as first-line therapy in patients with somatostatin receptor-positive (SSTR+) well-differentiated grade 2/3 advanced gastroenteropancreatic neuroendocrine tumors (GEP-NETs) versus high-dose octreotide LAR alone 1 . Data were presented at the 2024 American Society of Clinical Oncology (ASCO) Gastrointestinal (GI) Cancers Symposium. “These positive results for Lutathera are practice-changing and offer new first-line treatment data for patients who have a significant unmet need. This study confirms the clinical benefit of first-line radioligand therapy for newly diagnosed patients living with these types of advanced GEP-NETs,” said Dr. Simron Singh, Associate Professor of Medicine at the University of Toronto and cofounder of the Susan Leslie Clinic for Neuroendocrine Tumours at the Odette Cancer Centre, Sunnybrook Health Sciences Centre, Ontario, Canada. “These findings should instill confidence among physicians in using Lutathera as a first-line treatment for patients with this life-threatening type of cancer.” Efficacy endpoint 1 Lutathera plus octreotide LAR vs. high-dose octreotide LAR Progression-free survival HR 0.28 (95% CI: 0.18, 0.42; p \\u003c0.0001) Median PFS (months) 22.8 month (95% CI: 19.4 -not estimable) vs. 8.5 months (95% CI: 7.7-13.8) Objective response rate (ORR)* 43% (95% CI: 35.0-51.3) vs. 9.3% (95% CI: 3.8-18.3), p\\u003c0.0001 *Assessed via RECIST 1.1 “This is the first positive Phase III trial of a radioligand therapy in the first-line setting, and the overall efficacy and safety results are amongst the most clinically relevant observed to date in this kind of advanced cancer, addressing a significant unmet need for patients with newly diagnosed advanced GEP-NETs,” said Jeff Legos, Global Head of Oncology Development at Novartis. “The positive results are a significant advancement and further reaffirm our strategy to research and develop radioligand therapies in earlier lines of treatment or stages of disease to improve outcomes for patients.” No new or unexpected safety findings were observed in the study and data are consistent with the already well-established safety profile of Lutathera 1 . Most patients (88%) in the Lutathera arm received all four cycles of Lutathera treatment. The most common all-grade AEs (≥20%) for the Lutathera arm vs. control arm were nausea (27.2% vs 17.8%), diarrhea (25.9% vs 34.2%) and abdominal pain (17.7% vs 27.4%), and the most common grade ≥3 AE (\\u003e5%) was lymphocyte count decreased (5.4% vs 0%). NETs are a type of cancer that originate in neuroendocrine cells throughout the body and are commonly considered slow-growing malignancies. However, some NETs are associated with rapid progression and poor prognosis and in many cases, diagnosis is delayed until patients have advanced disease 2-4 . Even though NETs are a rare (orphan) disease, their incidence has increased over the past several decades 2-5 and there is a need for continued research into treatment options for newly diagnosed patients. The NETTER-2 trial is ongoing for further evaluation of secondary endpoints including overall survival and long-term safety. About NETTER-2 NETTER-2 (NCT03972488) is an open-label, multi-center, randomized, comparator-controlled Phase III trial assessing whether Lutathera plus octreotide LAR when taken as a first-line treatment can prolong PFS in patients with high-proliferation rate tumors (G2 and G3), compared to treatment with high-dose (60 mg) long-acting octreotide 6 . Eligible patients were diagnosed with SSTR-positive advanced GEP-NETs within 6 months before enrollment 6 . About Lutathera ® Lutathera ® (INN: lutetium (177Lu) oxodotreotide / USAN: lutetium Lu 177 dotatate) is approved in the US for the treatment of adult patients with SSTR-positive GEP-NETs, including those in the foregut, midgut and hindgut, an indication which includes the NETTER-2 population. Lutathera is also approved in Europe for unresectable or metastatic, progressive, well-differentiated (G1 and G2), SSTR-positive GEP-NETs in adults 7,8 , and in Japan for SSTR-positive NETs. Novartis and Radioligand Therapy (RLT) Novartis is reimagining cancer care with RLT for patients with advanced cancers. By harnessing the power of radioactive atoms and applying it to advanced cancers, RLT is theoretically able to deliver radiation to target cells anywhere in the body 9,10 . Novartis is investigating a broad portfolio of RLTs, exploring new isotopes, ligands and combination therapies to look beyond gastroenteropancreatic neuroendocrine tumors (GEP-NETs) and prostate cancer and into breast, colon, lung and pancreatic cancer. With established global expertise, and specialized supply chain and manufacturing capabilities across the Novartis network, we are supporting growing demand for our RLT medicines. Our production capabilities continue to expand and now include sites in Millburn, US, Zaragoza, Spain, Ivrea, Italy and our new state-of-the-art facility in Indianapolis, US. We recently announced plans to expand our manufacturing capabilities and build additional points of supply in Sasayama, Japan, and Haiyan, Zhejiang, China, to produce RLTs for patients in Japan and China. We are continually evaluating additional opportunities to increase capacity around the world. Disclaimer This press release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements can generally be identified by words such as “potential,” “can,” “will,” “plan,” “may,” “could,” “would,” “expect,” “anticipate,” “seek,” “look forward,” “believe,” “committed,” “investigational,” “pipeline,” “launch,” or similar terms, or by express or implied discussions regarding potential marketing approvals, new indications or labeling for the investigational or approved products described in this press release, or regarding potential future revenues from such products. You should not place undue reliance on these statements. Such forward-looking statements are based on our current beliefs and expectations regarding future events and are subject to significant known and unknown risks and uncertainties. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those set forth in the forward-looking statements. There can be no guarantee that the investigational or approved products described in this press release will be submitted or approved for sale or for any additional indications or labeling in any market, or at any particular time. Nor can there be any guarantee that such products will be commercially successful in the future. In particular, our expectations regarding such products could be affected by, among other things, the uncertainties inherent in research and development, including clinical trial results and additional analysis of existing clinical data; regulatory actions or delays or government regulation generally; global trends toward health care cost containment, including government, payor and general public pricing and reimbursement pressures and requirements for increased pricing transparency; our ability to obtain or maintain proprietary intellectual property protection; the particular prescribing preferences of physicians and patients; general political, economic and business conditions, including the effects of and efforts to mitigate pandemic diseases; safety, quality, data integrity or manufacturing issues; potential or actual data security and data privacy breaches, or disruptions of our information technology systems, and other risks and factors referred to in Novartis AG’s current Form 20-F on file with the US Securities and Exchange Commission. Novartis is providing the information in this press release as of this date and does not undertake any obligation to update any forward-looking statements contained in this press release as a result of new information, future events or otherwise. About Novartis Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Reimagine medicine with us: Visit us at https://www.novartis.com and connect with us on LinkedIn , Facebook , X/Twitter and Instagram . References Novartis Data on File. Man D, Wu J, Shen Z, Zhu X. Prognosis of patients with neuroendocrine tumor: a SEER database analysis. Cancer Manag Res . 2018;10:5629-5638. Published 2018 Nov 13. doi:10.2147/CMAR.S174907Dasari. A, Shen C, Halperin D, Zhao B, Zhou S, Xu Y, Shih T, Yao JC. Trends in the Incidence, Prevalence, and Survival Outcomes in Patients With Neuroendocrine Tumors in the United States. JAMA Oncol . 2017; doi:10.1001/jamaoncol.2017.0589. Frilling A, Åkerström G, Falconi, M, et al. Neuroendocrine tumor disease: an evolving landscape. Endoc Related Cancer. 2012; 19: R163-815. Lawrence B, Gustafsson BI, et al. The Epidemiology of Gastroenteropancreatic Neuroendocrine Tumors. Endocrinol Metab Clin N Am . 2011; 40:1–18. ClinicalTrials.gov. NETTER-2 (NCT03972488). Study to Evaluate the Efficacy and Safety of Lutathera in Patients With Grade 2 and Grade 3 Advanced GEP-NET (NETTER-2). Accessed January 2024. Lutathera. Full Prescribing Information. 2018. Revised March 2023. https://www.novartis.com/us-en/sites/novartis_us/files/lutathera.pdf . Lutathera. Summary of Product Characteristics (SmPC). 2018. Revised February 2023. https://www.ema.europa.eu/en/documents/product-information/lutathera-epar-product-information_en.pdf . Jadvar H. Targeted radionuclide therapy: an evolution toward precision cancer treatment. AJR Am J Roentagenol . 2017;209(2);277-288. Jurcic JG, Wong JYC, Knoc SJ, et al. Targeted radionuclide therapy. In: Tepper JE, Foote RE, Michalski JM, eds. Gunderson \\u0026 Tepper’s Clinical Radiation Oncology. 5th ed. Elsevier, Inc. 2021;71(3):209-249. # # # Novartis Media Relations E-mail: [email protected] Central North America Richard Jarvis +41 79 584 2326 Julie Masow +1 862 579 8456 Anja von Treskow Anna Schäfers +41 79 392 9697 +41 79 801 7267 Michael Meo Marlena Abdinoor +1 862 274 5414 +1 617 335 9525 Switzerland Satoshi Sugimoto +41 79 619 2035 Novartis Investor Relations Central investor relations line: +41 61 324 7944 E-mail: [email protected] Central North America Samir Shah +41 61 324 7944 Sloan Simpson +1 862 345 4440 Isabella Zinck +41 61 324 7188 Jonathan Graham +1 201 602 9921 Nicole Zinsli-Somm +41 61 324 3809 Parag Mahanti +1 973 876 4912 Imke Kappes +41 61 324 8269 Reimagine Medicine Oncology Medical Innovations Cancer AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print pdf Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"Novartis expands production of Pluvicto™ with addition of its largest and most advanced radioligand therapy manufacturing facility in Indianapolis | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home News Novartis Expands Production Of Pluvicto™ With Addition Of Its Largest And Most Advanced Radioligand Therapy Manufacturing Facility In Indianapolis Novartis expands production of Pluvicto™ with addition of its largest and most advanced radioligand therapy manufacturing facility in Indianapolis Jan 05, 2024 FDA approval of the company’s second US Radioligand Therapy (RLT) manufacturing facility increases RLT production capacity to 250,000 doses in 2024 and beyond New 70,000-square foot RLT facility is the company’s largest and most advanced in the world to date and centrally located in the US to maximize access for patients and treatment centers With four active RLT manufacturing sites and unconstrained supply, Novartis can sufficiently meet current and future demand as ongoing clinical trials may present the potential to bring Pluvicto and Lutathera ® to more patients in earlier lines of treatment Novartis is investigating a broad portfolio of RLTs in advanced cancers including breast, colon, neuroendocrine, lung, pancreatic and prostate to continue meeting global patient needs Basel, January 5, 2024 — Novartis announced today that it has received approval from the US Food and Drug Administration (FDA) for commercial manufacturing of Pluvicto TM (INN: lutetium ( 177 Lu) vipivotide tetraxetan / USAN: lutetium Lu 177 vipivotide tetraxetan) at its new large-scale, state-of-the-art radioligand therapy (RLT) manufacturing facility in Indianapolis, Indiana, United States. The 70,000-square foot site, the company’s second US location, is designed specifically for RLT manufacturing and is now the largest and most advanced Novartis facility of its kind in the world. The Indianapolis site represents the next phase of RLT manufacturing growth as this new addition brings substantial supply increases for the foreseeable future. “The intricate process of providing RLTs to patients within hours of production requires precision manufacturing expertise to bring these medicines to individuals who critically need them,” said Steffen Lang, President, Operations, Novartis. “Adding a second US RLT facility, our largest and most advanced yet, into our manufacturing network underscores our commitment to ensure a consistent and reliable experience for patients and their healthcare teams for years to come. We also recently announced plans to build our manufacturing capabilities in Sasayama, Japan and Haiyan, Zhejiang, China, as we continue to look for opportunities to further expand our worldwide reach.” The Indianapolis facility, centrally located within the US, is purpose-built from the ground up to manufacture RLTs now and into the future and includes space for continued line expansion including plans for fully automated lines, a first for the radiopharmaceutical industry. The new site will supply the growing demand for patients in the US and eventually in Canada, upon approval, together with the company’s Millburn, New Jersey location. The site in Ivrea, Italy will continue to supply patients in and outside the US while the facility in Zaragoza, Spain will solely provide RLTs for patients outside the US. Novartis recently announced that supply of Pluvicto is unconstrained. Having doubled weekly production, Novartis currently has more than sufficient supply to treat patients within two weeks of diagnosis, which is important for these patients with advanced disease who may need treatment quickly. Novartis is committed to improving access to its RLTs, Pluvicto and Lutathera ® (INN: lutetium ( 177 Lu) oxodotreotide / USAN: lutetium Lu 177 dotatate) by adding more treatment sites in closer proximity to patients over the coming months. With four active manufacturing facilities, and a RLT production capacity of 250,000 doses in 2024 and beyond, Novartis continues to expand its worldwide RLT manufacturing network as ongoing clinical trials may present the potential to bring Pluvicto and Lutathera to more patients in earlier lines of treatment. Novartis and Radioligand Therapy (RLT) Novartis is committed to expanding the radioligand therapy platform to shape the future of RLT as a treatment class. By harnessing the power of radioactive atoms and applying it to advanced cancers, RLT is theoretically able to deliver radiation to target cells anywhere in the body 1,2 . We are investigating a broad portfolio of RLTs, exploring new isotopes, ligands and combination therapies to look beyond gastroenteropancreatic neuroendocrine tumors (GEP-NETs) and prostate cancer and into breast, colon, lung and pancreatic cancer. Novartis recently presented data at the 2023 European Society for Medical Oncology (ESMO) Congress studying Pluvicto in the pre-taxane setting for patients with prostate-specific membrane antigen (PSMA)-positive metastatic castration-resistance prostate cancer (mCRPC). With established global expertise, and specialized supply chain and manufacturing capabilities across its network, we are supporting growing demand for our RLT medicines. Our production capabilities continue to expand and now include sites in Millburn, US, Zaragoza, Spain, Ivrea, Italy and our new state-of-the-art facility in Indianapolis, US. We recently announced plans to expand our manufacturing capabilities and build additional points of supply in Sasayama, Japan and Haiyan, Zhejiang, China to produce RLTs for patients in Japan and China. We are continually evaluating additional opportunities to increase capacity around the world. Disclaimer This press release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements can generally be identified by words such as “potential,” “can,” “will,” “plan,” “may,” “could,” “would,” “expect,” “anticipate,” “seek,” “look forward,” “believe,” “committed,” “investigational,” “pipeline,” “launch,” or similar terms, or by express or implied discussions regarding potential marketing approvals, new indications or labeling for the investigational or approved products described in this press release, or regarding potential future revenues from such products. You should not place undue reliance on these statements. Such forward-looking statements are based on our current beliefs and expectations regarding future events, and are subject to significant known and unknown risks and uncertainties. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those set forth in the forward-looking statements. There can be no guarantee that the investigational or approved products described in this press release will be submitted or approved for sale or for any additional indications or labeling in any market, or at any particular time. Nor can there be any guarantee that such products will be commercially successful in the future. In particular, our expectations regarding such products could be affected by, among other things, the uncertainties inherent in research and development, including clinical trial results and additional analysis of existing clinical data; regulatory actions or delays or government regulation generally; global trends toward health care cost containment, including government, payor and general public pricing and reimbursement pressures and requirements for increased pricing transparency; our ability to obtain or maintain proprietary intellectual property protection; the particular prescribing preferences of physicians and patients; general political, economic and business conditions, including the effects of and efforts to mitigate pandemic diseases; safety, quality, data integrity or manufacturing issues; potential or actual data security and data privacy breaches, or disruptions of our information technology systems, and other risks and factors referred to in Novartis AG’s current Form 20-F on file with the US Securities and Exchange Commission. Novartis is providing the information in this press release as of this date and does not undertake any obligation to update any forward-looking statements contained in this press release as a result of new information, future events or otherwise. About Novartis Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Reimagine medicine with us: Visit us at https://www.novartis.com and connect with us on LinkedIn , Facebook , X/Twitter and Instagram . References Jadvar H. Targeted Radionuclide Therapy: An Evolution Toward Precision Cancer Treatment [published correction appears in AJR Am J Roentgenol. 2017 Oct;209(4):9/49]. AJR Am J Roentgenol . 2017;209(2):277-288. doi:10.2214/AJR.17.18264. Jurcic JG, Wong JYC, Knoc SJ, et al. Targeted radionuclide therapy. In: Tepper JE, Foote RE, Michalski JM, eds. Gunderson \\u0026 Tepper’s Clinical Radiation Oncology. 5th ed. Elsevier, Inc. 2021;71(3):209-249. # # # Novartis Media Relations E-mail: [email protected] Central North America Richard Jarvis +41 79 584 2326 Julie Masow +1 862 579 8456 Anja von Treskow +41 79 392 9697 Michael Meo +1 862 274 5414 Anna Schäfers +41 79 801 7267 Marlena Abdinoor +1 617 335 9525 Switzerland Satoshi Sugimoto +41 79 619 2035 Novartis Investor Relations Central investor relations line: +41 61 324 7944 E-mail: [email protected] Central North America Samir Shah +41 61 324 7944 Sloan Simpson +1 862 345 4440 Nicole Zinsli-Somm +41 61 324 3809 Parag Mahanti +1 973 876 4912 Isabella Zinck +41 61 324 7188 Jonathan Graham +1 201 602 9921 Imke Kappes +41 61 324 82 69 Zain Iqbal +41 61 324 03 90 Oncology Innovation Drug Discovery Diseases AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print pdf Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\"],\"rejected_links\":[\"An Open-label Study Comparing Lutetium (177Lu) Vipivotide Tetraxetan Versus Observation in PSMA Positive OMPC. | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home Clinical Trials Recruiting Clinical Trials An Open-label Study Comparing Lutetium (177Lu) Vipivotide Tetraxetan Versus Observation In PSMA Positive OMPC. An Open-label Study Comparing Lutetium (177Lu) Vipivotide Tetraxetan Versus Observation in PSMA Positive OMPC. Last Update: May 03, 2024 An International, Prospective, Open-label, Multi-center, Randomized Phase III Study Comparing Lutetium (177Lu) Vipivotide Tetraxetan (AAA617) Versus Observation to Delay Castration or Disease Recurrence in Adult Male Patients With Prostate-specific Membrane Antigen (PSMA) Positive Oligometastatic Prostate Cancer (OMPC) ClinicalTrials.gov Identifier: NCT05939414 Novartis Reference Number: CAAA617D12302 See if you Pre-qualify All compounds are either investigational or being studied for (a) new use(s). Efficacy and safety have not been established. There is no guarantee that they will become commercially available for the use(s) under investigation. Study Description The purpose of this study is to evaluate the efficacy and safety of lutetium (177Lu) vipivotide tetraxetan (AAA617) in participants with oligometastatic prostate cancer (OMPC) progressing after definitive therapy to their primary tumor. The data generated from this study will provide evidence for the treatment of AAA617 in early-stage prostate cancer patients to control recurrent tumor from progressing to fatal metastatic disease while preserving quality of life by delaying treatment with androgen deprivation therapy (ADT). All participants will be assessed for eligibility and will undergo baseline disease assessments including a mandatory gallium (68Ga) gozetotide (also known as [68Ga]Ga-PSMA-11) or piflufolastat (18F) ( also known as[18F]DCFPyL) PET/CT scan and conventional imaging (i.e., CT/MRI and bone scans). Piflufolastat (18F) PET/CT scan will be performed in countries where it is approved. Stereotactic Body Radiation Therapy (SBRT) will be administered to all metastatic Prostate Cancer (PC) lesions after randomization and before the start of treatment with AAA617 or observation. The duration of SBRT procedures is approximately 3 weeks. For participants randomized to the investigational arm (AAA617), the treatment duration will be up to 4 cycles of AAA617. For participants randomized to the control arm (observation) the treatment duration will end at the last fraction of SBRT administration. The visit frequency will be every week 1 and 3 of each of the 4 cycles and every 16 weeks thereafter (for both arms) until first event of disease progression (RECIST 1.1) The study duration is approximately 6.5 years. Condition Oligometastatic Prostate Cancer (OMPC) Phase Phase 3 Overall Status Recruiting Number of Participants 450 Start Date Mar 12, 2024 Completion Date Jun 03, 2030 Gender Male Age(s) 18 Years - (Adult, Older Adult) Interventions Drug AAA617 Stereotactic Body Radiation Therapy (SBRT) followed by AAA617 will be administered once every 6 weeks (1 cycle) for a planned 4 cycles to participants randomized to the Investigational arm Eligibility Criteria Key Inclusion criteria: Histologically confirmed prostate cancer prior to randomization Participants must have biochemically recurrent disease after definitive treatment to prostate by Radical Prostatectomy ((RP), (alone or with post-operative radiation to prostate bed/pelvic nodes)) or External beam Radiation Therapy (XRT), (prostate alone or prostate with seminal vesicle and/or pelvic nodes) and/or brachytherapy prior to randomization. Biochemical recurrence is defined as: nadir PSA + 2 ng/mL post XRT (if participant received-radiation therapy to intact prostate) and PSA \\u003e 0.2 ng/mL and rising post RP (with or without post-operation Radiation Therapy (RT)) Participants must have OMPC with =\\u003c 5 PSMA-positive metastatic lesions on screening PSMA PET/CT scan (with either gallium (68Ga) gozetotide or piflufolastat (18F)) as visually assessed by BIRC based on the methodology proposed in the Prostate Cancer Molecular Imaging Standardized Evaluation (PROMISE v2) (Seifert et al 2023); for further details, please refer to Section 8.1 and the Imaging Manual. Metastatic lesions may include regional/pelvic lymph nodes (N1), distant lymph nodes (M1a), bone (M1b), lung and others visceral (M1c) except liver and brain classified using AJCC 8. When counting the number of oligometastatic lesions, each lesion is counted as distinct metastasis irrespective of its anatomical location (e.g., one pelvic and one extra-pelvic lymph node will be counted as two metastatic lesions) At least 1 PSMA-positive lesion should be a distant metastasis (M1) per AJCC8 classification at screening. For AJCC M staging, PSMA PET information should be used Participants must have a negative conventional imaging for M1 disease at screening. Note: For a participant not to be eligible, CI positive M1 lesions should be unequivocal in CI scans, i.e., potentially not attributable to findings thought to represent something other than tumor (e.g., degenerative, or post-traumatic changes or Paget's disease in bone lesions). For conventional imaging assessments, bone lesions must be assessed by bone scan only and soft tissue lesions must be assessed by CT/MRI scans only at screening. Prior knowledge of PSMA PET positivity should not influence the radiologist (reader) in determination of CI positivity. Two different readers will be involved, one reader for PSMA PET scan and one reader for CI: Reader will be blinded to PSMA PET scan results while reading CI scans. Reader should not modify their assessment of CI scans (e.g. changing a lesion previously identified as equivocal in CI to unequivocal) after reading the PSMA PET scan. Similarly, biopsy positivity should not influence the reader in the assessment of CI positivity. More details on the reading paradigm will be provided in the imaging charter MRI for radiation treatment planning may show M1 disease but this will not exclude the participant from the study if the lesion is deemed negative per baseline CT or bone scans Participants with pelvic disease (N1) seen in conventional imaging are allowed if the local spread is below common iliac bifurcation (per AJCC 8 definition of local disease) Distant lymph node disease (M1a) that is visible per CI and less than 10mm in the short axis is not exclusionary irrespective of PSMA PET positivity. If a previously surgically removed lesion was unequivocal for M1 by bone scan or CT, the participant is not eligible. All metastatic lesions detected at screening should be amenable to SBRT Non-castration testosterone level \\u003e100 ng/dL at screening Key Exclusion criteria: Participants with de novo OMPC at screening Unmanageable concurrent bladder outflow obstruction or urinary incontinence at screening. Note: participants with bladder outflow obstruction or urinary incontinence, which is manageable and controlled with best available standard of care (incl. pads, drainage) are allowed Prior therapy with: ADT including bilateral orchiectomy Participants who had XRT or RP and completed adjuvant ADT (or ADT+ARPI) prior to recurrence are eligible to participate if the last dose of ADT (or ADT+ARPI) was before 12 months from randomization. Participants who had prior SBRT with short term ADT (3-6 months) are also allowed if the ADT was stopped at least 12 months before randomization. Participants who discontinued ADT due to disease progression are not allowed (i.e., Castration-Resistant Prostate Cancer (CRPC) participants) Other hormonal therapy. e.g., Use of estrogens, 5-α reductase inhibitors (finasteride, dutasteride), other steroidogenesis inhibitors (aminoglutethimide) if used in the context of prostate cancer treatment. Same medications are allowed if used for other indications: e.g., Benign Prostatic Hyperplasia (BPH), if stopped at least 5 half-lives before randomization. First-generation anti-androgens (bicalutamide, flutamide, nilutamide, cyproterone) Second generation anti-androgens (e.g., enzalutamide, apalutamide and darolutamide) CYP17 inhibitors (e.g., abiraterone acetate, orteronel, galeterone, ketoconazole). Short term ketoconazole treatment (\\u003c28 days) is permitted Radiopharmaceutical agents (e.g., Strontium-89, PSMA-targeted radioligand therapy) Immunotherapy (e.g., sipuleucel-T) Chemotherapy, except if administered in the adjuvant/neoadjuvant setting completed \\u003e 12 months before randomization Any other investigational or systemic agents for metastatic disease Radiation therapy external beam radiation therapy (EBRT) and brachytherapy within 28 days before randomization Concurrent cytotoxic chemotherapy, immunotherapy, radioligand therapy, hormonal therapy (see ADT initiation guidance in Section 6.8.2), Poly Adenosine Diphosphate-Ribose Polymerase (PARP) inhibitor, biological therapy or investigational therapy Diagnosed at screening with other malignancies that are expected to alter life expectancy or may interfere with disease assessment. However, participants with a prior history of malignancy that has been adequately treated and who have been disease/treatment free for more than 3 years are eligible, as are participants with adequately treated non-melanoma skin cancer and superficial bladder cancer. History or current diagnosis of ECG abnormalities indicating significant risk of safety for participants participating in the study such as: Concomitant clinically significant cardiac arrhythmias, e.g. sustained ventricular tachycardia, and clinically significant second or third degree Atrioventricular (AV) block without a pacemaker History of familial long QT syndrome or known family history of Torsades de Pointe Participants in immediate need of ADT as assessed by the investigator. Other protocol defined Inclusion/Exclusion may apply. Study Location Australia Novartis Investigative Site Recruiting Adelaide,South Australia,5000,Australia Novartis Investigative Site Recruiting Darlinghurst,New South Wales,2010,Australia Canada Novartis Investigative Site Recruiting Montreal,Quebec,H2X 3E4,Canada Novartis Investigative Site Recruiting Montreal,Quebec,H3T 1E2,Canada Israel Novartis Investigative Site Recruiting Haifa,3109601,Israel Novartis Investigative Site Recruiting Jerusalem,9112001,Israel Novartis Investigative Site Recruiting Tel Aviv,6423906,Israel Japan Novartis Investigative Site Recruiting Kobe-city,Hyogo,650-0047,Japan Singapore Novartis Investigative Site Recruiting Singapore,119228,Singapore Novartis Investigative Site Recruiting Singapore,168583,Singapore Switzerland Novartis Investigative Site Recruiting Luzern,6006,Switzerland Novartis Investigative Site Recruiting Geneve,1205,Switzerland United States Virginia Oncology Associates . Recruiting Norfolk,Teri Raymond (757-466-8683) email: [email protected] -- Mark Fleming,23502 - Virginia,United States Worldwide Contacts If the location of your choosing does not feature any contact detail, please reach out using the information below. Novartis Pharmaceuticals Phone: +41613241111 Email: [email protected] Novartis Pharmaceuticals Phone: 1-888-669-6682 Email: [email protected] AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print PDF Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\"],\"test_link\":[{\"content\":\"Study of 225Ac-PSMA-617 in Men With PSMA-positive Prostate Cancer | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home Clinical Trials Recruiting Clinical Trials Study Of 225Ac-PSMA-617 In Men With PSMA-positive Prostate Cancer Study of 225Ac-PSMA-617 in Men With PSMA-positive Prostate Cancer Last Update: Feb 14, 2024 AcTION: A Phase I Study of [225Ac]Ac-PSMA-617 in Men With PSMA-positive Prostate Cancer With or Without Prior [177Lu]Lu-PSMA-617 Radioligand Therapy ClinicalTrials.gov Identifier: NCT04597411 Novartis Reference Number: PSMA-617-100 See if you Pre-qualify All compounds are either investigational or being studied for (a) new use(s). Efficacy and safety have not been established. There is no guarantee that they will become commercially available for the use(s) under investigation. Study Description This is a Phase 1, open-label, international, dose escalation study to evaluate the safety of [225Ac]Ac-PSMA-617 (225Ac-PSMA-617) in men with PSMA-positive prostate cancer who have and have not had prior exposure to [177Lu]Lu-PSMA-617 (177Lu-PSMA-617) or [177Lu]Lu-PSMA I\\u0026T (177Lu-PSMA I\\u0026T). The study schedule for each patient consists of a screening phase, a treatment phase, safety and long-term follow up phase, for an overall individual duration of approximately 32 months. A minimum of 3 patients will be treated in each patient group at each dose level and evaluated for the occurrence of dose-limiting toxicity (DLT) during the first 6 weeks of treatment before consideration will be given to enrolling patients into the next dose level. Dose modifications for toxicity are allowed beyond the first 6 weeks of therapy and defined per protocol. No more than 6 cycles of 225Ac-PSMA-617 will be administered. Patients may receive less than 6 cycles if they have disease progression, intolerable toxicity, started other anticancer therapy, or have withdrawn from treatment per subject or physician decision. Subjects may also receive supportive care therapy, as determined by the investigative physician, however, subjects cannot receive concurrent investigational agents, cytotoxic chemotherapy, biological agents, targeted therapy, immunotherapy, other systemic radioisotopes, and hemi-body radiotherapy or novel androgen axis drugs [ARPIs] until completion of treatment with 225Ac-PSMA-617. Condition Prostatic Neoplasms, Castration-Resistant Phase Phase 1 Overall Status Recruiting Number of Participants 60 Start Date Apr 01, 2021 Completion Date Jan 01, 2027 Gender Male Age(s) 18 Years - (Adult, Older Adult) Interventions Radiation 225^Ac-PSMA-617 administered intravenously under the dose escalation schedule Radiation 68^Ga-PSMA-11 administered intravenously at a dose of 111 - 185 MBq (3 - 5 mCi) Eligibility Criteria Inclusion Criteria: Patients must have the ability to understand and sign an approved ICF. Patients must have the ability to understand and comply with all protocol requirements. Patients must be \\u003e=18 years of age. Patients must have an ECOG performance status of 0 to 2. Patients must have had histological, pathological, and/or cytological confirmation of prostate cancer. Patients must have a positive 68Ga-PSMA-11 PET/CT scan performed within 28 days of study entry as described in Imaging Manual). Patients must have recovered or stabilized to =\\u003c Grade 2 or baseline from all clinically significant toxicities related to prior prostate cancer therapy. Determination of disease progression on treatment prior to enrollment. Progressive disease for study entry is defined as any one or more of the following: PSA progression: minimum of two rising PSA values from a baseline measurement with an interval of \\u003e= 1 week between each measurement. 2.0 ng/mL is the minimal starting value if PSA rise is only indication of progression. Soft tissue or visceral disease progression as per RECIST 1.1 criteria: increase \\u003e= 20% in the sum of the diameter (SOD) (short axis for nodal lesions and long axis for non-nodal lesions) of all target lesions based on the smallest SOD since treatment started or the appearance of one or more new lesions. Bone progression: \\u003e= 2 new lesions on bone scan. Patients must have adequate organ function (bone morrow reserve, hepatic function and renal function). Known HIV-positive patients who are healthy and have a low risk of AIDS-related outcomes are eligible. HIV testing is required. For patients who have partners of childbearing potential, patient must use a method of birth control with adequate barrier protection, deemed acceptable by the principle investigator during the study and for 6 months after last study drug administration. Group A Subjects: Patients must have prior orchiectomy and/or ongoing androgen-deprivation therapy, a castrate level of serum testosterone (\\u003c 50 ng/dL or \\u003c 1.7 nmol/L) and must have received prior cytotoxic chemotherapy and a novel androgen axis drug (e.g., abiraterone or enzalutamide). Patients must also be naïve to prior 177Lu-PSMA radioligand therapy (177Lu-PSMA-617 or 177Lu-PSMA I\\u0026T) Group B Subjects (South-Africa only): Patients must have ongoing androgen deprivation therapy (ADT) and either prior orchiectomy or be medically castrate using LHRH agonists/antagonists in order to achieve adequate suppression of serum testosterone (\\u003c 50 ng/dL) but must not have received prior cytotoxic chemotherapy or novel androgen axis drugs (e.g., abiraterone or enzalutamide). These patients are naïve to 177Lu-PSMA radioligand therapy (177Lu-PSMA-617 or 177Lu-PSMA I\\u0026T). Group C Subjects: Patients must have ongoing androgen deprivation therapy (ADT) and either prior orchiectomy or be medically castrate using LHRH agonists/antagonists in order to achieve adequate suppression of serum testosterone (\\u003c 50 ng/dL). Patients must have been treated with prior 177Lu-PSMA radioligand therapy (177Lu-PSMA-617 or 177Lu-PSMA I\\u0026T) for at least one cycle administered greater than 6 weeks from study enrollment, and been evaluated for biochemical and radiological response to therapy. Prior exposure to ARPI and/or chemotherapy is not required. Exclusion Criteria: Previous treatment with Strontium-89, Samarium-153, Rhenium-186, Rhenium-188, Radium-223 or hemi-body irradiation. Any investigational agents within 28 days of study enrollment. Known hypersensitivity to the components of the study therapy or its analogues. Other concurrent cytotoxic chemotherapy, targeted therapy, biologic agents, immunotherapy, radioligand therapy, or investigational therapy. Transfusion for the sole purpose of eligibility into the study. Patients with a history of CNS metastases must have received therapy (surgery, radiotherapy, gamma knife) and be neurologically stable, asymptomatic, and not receiving corticosteroids for the purposes of maintaining neurologic integrity. Patients with epidural disease, canal disease and prior cord involvement are eligible if those areas have been treated, are stable, and not neurologically impaired. Symptomatic cord compression, or clinical or radiologic findings indicative of impending cord compression. Concurrent serious (as determined by the Principal Investigator) medical conditions, including, but not limited to, uncontrolled infection, active hepatitis B or C, or other significant co-morbid conditions that in the opinion of the investigator would impair study participation or cooperation. Diagnosed with other malignancies that are expected to alter life expectancy or may interfere with disease assessment. Patients with a prior history of malignancy who have been disease free for more than 3 years are eligible. Participants with an active documented COVID-19 infection (any grade of disease severity) at the time of informed consent may be included only when completely recovered (in accordance with local guidance). Study Location Australia St. Vincent's Hospital Research Office-Translational Research Center Recruiting Darlinghurst,Louise Emmett, Prof,Australia South Africa Steve Biko Hospital-Department of Nuclear Medicine Recruiting Pretoria,Mike M Sathekge, Prof,South Africa Worldwide Contacts If the location of your choosing does not feature any contact detail, please reach out using the information below. Novartis Pharmaceuticals Phone: +41613241111 Email: [email protected] Novartis Pharmaceuticals Phone: 1-888-669-6682 Email: [email protected] AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print PDF Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"link\":\"https://www.novartis.com/clinicaltrials/study/nct04597411\"},{\"content\":\"Study of HRO761 Alone or in Combination in Cancer Patients With Specific DNA Alterations Called Microsatellite Instability or Mismatch Repair Deficiency. | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home Clinical Trials Recruiting Clinical Trials Study Of HRO761 Alone Or In Combination In Cancer Patients With Specific DNA Alterations Called Microsatellite Instability Or Mismatch Repair Deficiency. Study of HRO761 Alone or in Combination in Cancer Patients With Specific DNA Alterations Called Microsatellite Instability or Mismatch Repair Deficiency. Last Update: Apr 26, 2024 An Open-label, Multi-center Phase I/Ib Dose Finding and Expansion Study of HRO761 as Single Agent and in Combinations in Patients With Microsatellite Instability-High or Mismatch Repair Deficient Advanced Solid Tumors. ClinicalTrials.gov Identifier: NCT05838768 Novartis Reference Number: CHRO761A12101 See if you Pre-qualify All compounds are either investigational or being studied for (a) new use(s). Efficacy and safety have not been established. There is no guarantee that they will become commercially available for the use(s) under investigation. Study Description The main purpose of the study is to evaluate the safety and tolerability of HRO761 and identify the recommended dose(s), i.e., the optimal safe and active dose of HRO761 alone or in combination with tislelizumab or irinotecan that can be given to patients who have cancers with specific molecular alterations called MSIhi (Microsatellite Instability-high) or dMMR (Mismatch Repair Deficient) that might work best to treat these specific cancer types and to understand how well HRO761 is able to treat those cancers. The new drug being tested in the study, HRO761, is an oral drug that acts on a protein called Werner (WRN), which may contribute to cancer growth. By acting on WRN, HRO761 may be able to stop the growth of the cancer. This is the first time HRO761 is given to patients and the first time HRO761 is used in combination with tislelizumab or irinotecan. Tislelizumab has been used in other cancer studies in the past few years and irinotecan is a drug approved in several countries and is used as standard treatment for certain types of cancer (e.g., colon cancer and small cell lung cancer). This research study will consist of various treatment arms to investigate HRO761 as single agent and in the combinations. For HRO761 single agent, the research will be done in two parts the first part is called \\\"dose escalation\\\" and the second part is called \\\"dose optimization\\\" In the dose escalation part, different groups of people will be given different doses of HRO761 to understand how the body reacts to different doses of the drug and how well the drug acts against the cancer. During the dose optimization part, the selected doses will be tested in more patients until a recommended dose(s) is found. The combinations of HRO761with tislelizumab or irinotecan will also first be tested in a dose escalation part to find the recommended doses of HRO761 in these combinations. Once the recommended doses are determined, more people may be treated with HRO761 alone or together with tislelizumab or irinotecan to further assess the study treatment effects against various types of MSIhi or dMMR cancers. This part is called dose expansion. For this research, a number of blood and tissue samples will be collected during the study. Patients may be asked to come approximately 8 times to the clinic during the first 8 weeks and approximately every 2 or 4 weeks thereafter. Patients will be in the study as long as their study doctor believes that they may be benefiting from the study treatment, unless the patient decides to stop study treatment. Condition MSIhi or dMMR Advanced Unresectable or Metastatic Solid Tumors, Including Colorectal Cancers Phase Phase 1 Overall Status Recruiting Number of Participants 327 Start Date Jun 27, 2023 Completion Date Jan 31, 2030 Gender All Age(s) 18 Years - (Adult, Older Adult) Interventions Drug HRO761 Tablet Drug irinotecan Concentrate for solution for infusion Biological tislelizumab Concentrate for solution for infusion Eligibility Criteria Key Inclusion criteria: Patients with advanced unresectable or metastatic MSIhi or MMR deficient (dMMR) solid tumors who have progressed after or are intolerant to prior standard therapy. Arm A and C: Patients must have progressed on the most recent therapy for advanced disease including one prior line of immune checkpoint inhibitor therapy. Arm B: Patients may have received prior chemotherapy or targeted therapy but should not have or without prior treatment with immune checkpoint inhibitors. Eastern Cooperative Oncology Group (ECOG) Performance Status ≤ 1 Measurable disease as determined by RECIST version 1.1 HRO761 s.a. (Arm A) dose finding only: Patients must have a site of disease amenable to biopsy and be a candidate for tumor biopsy according to the treating institution's guidelines. Patients must be willing to undergo a new tumor biopsy at screening, and during therapy on the study. A biopsy from the same lesion is preferred if safe and medically feasible. Exceptions may be considered after documented discussion with Novartis. All patients (Arm A, B and C) will have available archival tumor tissue obtained prior to study treatment initiation (in addition to newly obtained tumor biopsy at screening for Arm A), to allow retrospective MSIhi/dMMR status confirmation. Key Exclusion criteria: Impaired cardiac function or clinically significant cardiac disease Clinically significant eye impairment Patients with a primary Central Nervous System (CNS) tumor or tumor metastatic to the CNS Human Immunodeficiency Virus (HIV) infection Active Hepatitis B Virus (HBV), Hepatitis C Virus (HCV) or Tuberculosis infection. Patients whose disease is controlled under antiviral therapy should not be excluded. History of severe hypersensitivity reactions to any ingredient of study drug(s) Impairment of gastrointestinal function or gastrointestinal disease that may significantly alter the absorption of study drugs (e.g., severe ulcerative disease, uncontrolled nausea, vomiting, diarrhea, malabsorption syndrome, small bowel resection), except for prior gastrectomy. Other protocol-defined inclusion/exclusion criteria may apply Study Location Belgium Novartis Investigative Site Recruiting Bruxelles,1200,Belgium France Novartis Investigative Site Recruiting Marseille,13273,France Novartis Investigative Site Recruiting Bordeaux,33076,France Germany Novartis Investigative Site Recruiting Essen,45147,Germany Novartis Investigative Site Recruiting Ulm,89081,Germany Israel Novartis Investigative Site Recruiting Tel Aviv,6423906,Israel Japan Novartis Investigative Site Recruiting Kashiwa,Chiba,277 8577,Japan Korea, Republic of Novartis Investigative Site Recruiting Seoul,03722,Korea, Republic of Norway Novartis Investigative Site Recruiting Oslo,NO-0379,Norway Singapore Novartis Investigative Site Recruiting Singapore,119228,Singapore Spain Novartis Investigative Site Recruiting Madrid,28009,Spain Novartis Investigative Site Recruiting Barcelona,Catalunya,08035,Spain Novartis Investigative Site Recruiting Valencia,Comunidad Valenciana,46010,Spain Taiwan Novartis Investigative Site Recruiting Taipei,10002,Taiwan United States Univ of TX MD Anderson Cancer Cntr Primary Recruiting Houston,Timothy Yap,77030 - Texas,United States University Of California LA Dept of Onc Recruiting Los Angeles,Lisa Zhou (310-582-4069) email: [email protected] -- Zev A Wainberg,90095 - California,United States Columbia University Medical Ctr . Recruiting New York,Joy Kim (646-317-4850) email: [email protected] -- Edmond Chan,10032 - New York,United States Memorial Sloan Kettering Dept. of MSKCC Recruiting New York,Jill Weiss (+1 646 227 2157) email: [email protected] -- Michael Bonner Foote,10017 - New York,United States Worldwide Contacts If the location of your choosing does not feature any contact detail, please reach out using the information below. Novartis Pharmaceuticals Phone: +41613241111 Email: Novartis Pharmaceuticals Phone: 1-888-669-6682 Email: [email protected] AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print PDF Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"link\":\"https://www.novartis.com/clinicaltrials/study/nct05838768\"},{\"content\":\"A Phase I/II, Open-label, Multi-center Study of [225Ac]Ac-PSMA-R2 in Men With PSMA-positive Prostate Cancer With or Without Prior 177Lu-PSMA Radioligand Therapy. | Novartis Skip to main content Search Search Global | en Choose Location International Americas Asia Pacific Europe Middle East \\u0026 Africa Global | English Novartis Foundation | English Argentina | Español Brazil | Português Canada | English Canada | Français Central America | Español Colombia | Español Mexico | Español United States | English Australia | English Bangladesh | English Hong Kong S.A.R. | 繁體中文 India | English Indonesia | English Japan | 日本語 Korea | 한국어 Mainland China | 中文 Malaysia | English Pakistan | English Philippines | English Singapore | English Taiwan | 繁體中文 Thailand | ภาษาไทย Austria | Deutsch Belgium | Français Belgium | Nederlands Bulgaria | Български Czech Republic | Česky Czech Republic | English Denmark | Dansk Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hungary | Magyar Ireland | English Italy | Italiano Latvia | Latvian Lithuania | Lithuanian Netherlands | Nederlands Norway | Norsk Poland | Polski Portugal | Português Romania | Română Russia | Русский Serbia | Srpski Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Türkiye | Türkçe United Kingdom | English Egypt | English Israel | עברית Saudi Arabia | العربية South Africa | English Global Choose Location international International Americas Asia Pacific Europe Middle East \\u0026 Africa Argentina | Español Australia | English Austria | Deutsch Bangladesh | English Belgium | Français Belgium | Nederlands Brazil | Português Bulgaria | Български Canada | English Canada | Français Central America | Español Colombia | Español Czech Republic | Česky Czech Republic | English Denmark | Dansk Egypt | English Estonia | Eesti Finland | Suomalainen France | Français Germany | Deutsch Greece | Ελληνικά Hong Kong S.A.R. | 繁體中文 Hungary | Magyar India | English Indonesia | English Ireland | English Israel | עברית Italy | Italiano Japan | 日本語 Korea | 한국어 Latvia | Latvian Lithuania | Lithuanian Mainland China | 中文 Malaysia | English Mexico | Español Netherlands | Nederlands Norway | Norsk Global | English Novartis Foundation | English Pakistan | English Philippines | English Poland | Polski Portugal | Português Romania | Română Russia | Русский Saudi Arabia | العربية Serbia | Srpski Singapore | English Slovakia | Slovensky Slovenia | Slovenščina Slovenia | English South Africa | English Spain | Español Sweden | Svenska Switzerland | Deutsch Switzerland | Français Taiwan | 繁體中文 Thailand | ภาษาไทย Türkiye | Türkçe United Kingdom | English United States | English Menu About Board of Directors Joerg Reinhardt Simon Moroney Nancy C. Andrews Ton Buechner Patrice Bula Elizabeth (Liz) Doherty Ana de Pro Gonzalo Bridgette Heller Daniel Hochstrasser Frans van Houten Charles L. Sawyers William T. Winters John D. Young Charlotte Pamer-Wieser Executive Committee Vasant (Vas) Narasimhan Shreeram Aradhye Victor Bulto Aharon (Ronny) Gal Karen L. Hale Patrick Horber Harry Kirsch Rob Kowalski Steffen Lang Fiona Marshall Klaus Moosmayer Lutz Hegemann Kees Roks Michelle Weese Products Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology People and culture Diversity, equity and inclusion Equity Inclusivity Parental leave Society Novartis Gene Therapies Manufacturing Quality Audit program Novartis quality management system (QMS) Product and patient safety training Regulatory inspections Product recalls Third-party suppliers Awards and recognition About Novartis is an innovative medicines company. Every day, we work to reimagine medicine to improve and extend people’s lives so that patients, healthcare professionals and societies are empowered in the face of serious disease. Our medicines reach more than 250 million people worldwide. Patients and caregivers Novartis commitment to patients and caregivers Diseases Patient organization funding Patients perspectives stories Patients and caregivers Information for patients and their caregivers including clinical trial recruiting, managed access programs, funding opportunities for patient organizations and side effects reporting. Healthcare professionals Medical congresses and events Abstract summaries for EULAR Abstract summaries for ACR ASCO annual meeting Products Novartis pipeline Managed access programs Novartis Gene Therapies managed access program Novartis external funding Healthcare professional resources by country Investigator-initiated trials / studies Novartis medical information Submit medical enquiry Healthcare professionals Resources for physicians and other healthcare professionals including clinical trial recruiting, grant funding, congresses and country-level information. Research and development Technology platforms Research disease areas Cardiovascular and metabolic disease research at Novartis DAx: exploratory disease research at Novartis Global Health disease area research at Novartis Immunology disease research at Novartis Neuroscience research at Novartis Oncology research at Novartis Ophthalmology research at Novartis Novartis pipeline Research collaborations Collaborations Research \\u0026 development Discover how Novartis turns breakthrough science into transformative, high-value treatments. ESG Access Creating sustainable business models Value-based pricing Sub-Saharan Africa Donations Novartis access principles Novartis oncology access Patents and licensing Environmental sustainability Climate Waste Water Ethics, risk and compliance Ethical behavior Compliance Human rights Learning and engagement Risk management Global health Pandemic preparedness Avoidable blindness Chagas disease Leprosy Malaria Sickle cell disease (SCD) Novartis Foundation Diversity, equity and inclusion ESG index Reporting and transparency hub Novartis in Society Integrated Report ESG rating performance Targets Patient organization funding Payments to healthcare professionals Public policy A living wage A safe workplace Animal research Environmental, social and governance Learn about our commitments to making a positive impact on the world by providing access to innovative medicines, protecting the environment, and upholding high ethical standards. Explore the Novartis in Society Integrated Report. Investors Event calendar Financial data Novartis annual results Novartis quarterly results Novartis SEC filings Product sales Fixed-income securities Expected currency impact Share data and analysis Share monitor Dividend information Share ownership Share overview Return on investment calculator Shareholder information General Meetings American Depositary Receipts (ADR) Share buyback Frequently asked questions Company overview Corporate governance Reporting and transparency hub Novartis in Society Integrated Report Reporting archive ESG rating performance Publications order form ESG Investors Updates and resources for investors including financial information, disclosures, events, share price, ESG and reporting. News News archive Media library Stories Subscribe News Information for journalists including media releases, statements, stories, multimedia resources and more. Careers Career search Our business functions Careers in research and development Careers in operations Careers in commercial and sales Careers in global functions Why Novartis Career hub Temporary contracts Early careers Graduates Students US Biomedical Research internship programs Community exploration and learning lab (CELL) Careers Novartis is hiring! Find open positions, learn more about our strategy and culture, and apply today. Clinical trials Partnering Supplier portal Report side effects Contacts Home Working together, we can reimagine medicine to improve and extend people’s lives. Home Clinical Trials Recruiting Clinical Trials A Phase I/II, Open-label, Multi-center Study Of [225Ac]Ac-PSMA-R2 In Men With PSMA-positive Prostate Cancer With Or Without Prior 177Lu-PSMA Radioligand Therapy. A Phase I/II, Open-label, Multi-center Study of [225Ac]Ac-PSMA-R2 in Men With PSMA-positive Prostate Cancer With or Without Prior 177Lu-PSMA Radioligand Therapy. Last Update: Feb 28, 2024 SatisfACtion: A Phase I/II, Open-label, Multi-center Study of [225Ac]Ac-PSMA-R2 in Men With Heavily Pre-treated PSMA Positive Metastatic Castration Resistant Prostate Cancer (mCRPC) With or Without Prior 177Lu-labelled PSMA-targeted Radioligand Therapy. ClinicalTrials.gov Identifier: NCT05983198 Novartis Reference Number: CAAA802A12101 See if you Pre-qualify All compounds are either investigational or being studied for (a) new use(s). Efficacy and safety have not been established. There is no guarantee that they will become commercially available for the use(s) under investigation. Study Description The purpose of the study is to characterize the safety, tolerability, pharmacokinetics (PK), and anti-tumor activity of 225Ac-PSMA-R2 in male adult participants with metastatic castration-resistant prostate cancer (mCRPC) previously treated with androgen receptor pathway inhibitors in post-177Lu and pre-177Lu settings. This is an open label, phase I/II, multi-center study which contains two treatment groups (Group 1 and Group 2). Each group has a dose escalation part, once the Maximum Tolerated Dose/Recommended Dose for Expansion (MTD/RDE) is determined in each of the dose escalation parts, the study will continue with an expansion part in the respective group. The dose escalation parts will establish the MTD/RDE of the 225Ac-PSMA-R2 guided by the well-established Bayesian Logistic Regression Model (BLRM) method. The adaptive BLRM will be guided by the Escalation with Overdose Control (EWOC) principle to control the risk of DLT in future participants on study. Dose escalation decisions will be performed by the Investigators and Novartis during dose escalation meetings (DEMs) based on safety and tolerability information (BLRM summaries of DLT risk) along with PK and preliminary efficacy information. The dose expansion parts will assess the anti-tumor activity (Overall Response Rate (ORR) by Prostate Cancer Working Group 3 (PCWG3) modified RECIST 1.1 and Prostate Specific Antigen 50 (PSA50) response rate) as well as further assess the safety, tolerability, and PK of 225Ac-PSMA-R2. Condition Metastatic Castration-resistant Prostate Cancer (mCRPC) Phase Phase 1, Phase 2 Overall Status Recruiting Number of Participants 200 Start Date Nov 07, 2023 Completion Date Aug 28, 2026 Gender Male Age(s) 18 Years - (Adult, Older Adult) Interventions Drug 225Ac-PSMA-R2 PSMA-R2 is a ligand coupled with 225Ac an alpha emitting radionuclide Radiation 68Ga-PSMA-R2 Kit for radiopharmaceutical preparation Eligibility Criteria Key Inclusion Criteria: Evidence of PSMA-positive disease by 68Ga-PSMA-R2 PET/CT and eligible as determined by central reading Documented progressive mCRPC Adequate organ function (bone marrow reserve, hepatic, renal) Prior orchiectomy and/or ongoing ARPI and taxane-based chemotherapy and should have received prior 177Lu-PSMA-RLT (Group1 dose escalation \\u0026 expansion) or never received 177Lu-PSMA-RLT (Group 2 dose escalation \\u0026 expansion). Key Exclusion Criteria: Any other investigational agents within 28 days of the anticipated C1D1 of 225Ac-PSMA-R2 therapy Any systemic anti-cancer therapy within 28 days of the anticipated C1D1 of 225Ac-PSMA-R2 therapy Uncontrolled pain or incompatibility that may result in participant's lack of ability to comply with imaging procedures History of CNS metastases and symptomatic cord compression, or clinical or radiologic findings indicative of impending cord compression Uncontrolled cardiovascular history Diagnosis of other malignancies expected to alter life expectancy or may interfere with disease assessment Other protocol-defined inclusion/exclusion criteria may apply. Study Location France Novartis Investigative Site Recruiting Dijon,Cote D Or,21034,France Novartis Investigative Site Recruiting Lyon,69373,France Novartis Investigative Site Recruiting Nantes Cedex 1,44093,France Novartis Investigative Site Recruiting Saint Herblain,44805,France Novartis Investigative Site Recruiting Vandoeuvre,54511,France Novartis Investigative Site Recruiting Clermont-Ferrand,63011,France Worldwide Contacts If the location of your choosing does not feature any contact detail, please reach out using the information below. Novartis Pharmaceuticals Phone: +41613241111 Email: Novartis Pharmaceuticals Phone: 1-888-669-6682 Email: [email protected] AddToAny buttons Share Post Share Whatsapp Linkedin Email Printable Links Block (Content) Print PDF Novartis Working together Working together Patients and caregivers Healthcare professionals Researchers Job seekers Journalists Investors Topics Topics My Cancer. My Words. Access Diversity ESG SpeakUp Explore Explore Pipeline Products Clinical trials Partnering Stories Therapeutic areas Therapeutic areas Cardiovascular, renal and metabolic Immunology Neuroscience Oncology Search Footer Bottom Footer Bottom © 2024 Novartis AG Terms of use Privacy Cookie settings Contacts Locations Site map Open source Web accessibility Novartis Site Directory This site is intended for a global audience\",\"link\":\"https://www.novartis.com/clinicaltrials/study/nct05983198\"}]}"
}
